<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="0" type="Parameter" version="opset1">
			<data shape="1,16,512" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,D,C]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_17336" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 512" offset="0" size="32768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="250" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="250">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Convert_269" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="32768" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="264" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="264">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="267" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32792" size="8" />
			<output>
				<port id="0" precision="I64" names="267">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="268" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="268">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="261" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="252,255,258,261">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_14398" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_266" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="262" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="269">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="270" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="270">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="271" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="271">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="218" type="Const" version="opset1">
			<data element_type="f32" shape="8, 512, 64" offset="32824" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="218">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="290" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="290">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="293" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="293">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_14407" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081400" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_254" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="253" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="294">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="295" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081408" size="8" />
			<output>
				<port id="0" precision="I64" names="295">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="296" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="296">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="297" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="297">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Convert_334" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="32768" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="273" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="273">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="276" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32792" size="8" />
			<output>
				<port id="0" precision="I64" names="276">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="277" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="277">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_14416" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="2620" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="278">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="279" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="279">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="280" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="280">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="219" type="Const" version="opset1">
			<data element_type="f32" shape="8, 512, 64" offset="1081416" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="219">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="298" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="298">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="301" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="301">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_14425" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081400" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_258" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="256" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="302">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="303" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081408" size="8" />
			<output>
				<port id="0" precision="I64" names="303">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="304" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="304">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="305" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="305">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_17337" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2129992" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Multiply_17244" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="317" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="317">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="319" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="319,322">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="318" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" names="318" />
			</output>
		</layer>
		<layer id="44" name="Constant_626" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="45" name="320" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="320" />
			</output>
		</layer>
		<layer id="46" name="321" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1081400" size="8" />
			<output>
				<port id="0" precision="I64" names="321" />
			</output>
		</layer>
		<layer id="47" name="Constant_630" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="48" name="323" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="323" />
			</output>
		</layer>
		<layer id="49" name="324" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="324" />
			</output>
		</layer>
		<layer id="50" name="Constant_634" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="326" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="326">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="327" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="327">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="328" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="328">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="329" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="329">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_687" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2129996" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Reshape_688" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Softmax_694" type="SoftMax" version="opset8">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="ShapeOf_695" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="330" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="330">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_14680" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2130012" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_14681" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="62" name="Gather_14682" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="334" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="334">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="335" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="335">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="337" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="337">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Convert_399" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="32768" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="282" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="282">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="285" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32792" size="8" />
			<output>
				<port id="0" precision="I64" names="285">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="286" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="286">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_14452" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="2621" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="287">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="288" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="288">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="289" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="289">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="220" type="Const" version="opset1">
			<data element_type="f32" shape="8, 512, 64" offset="2130028" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="220">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="306" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="306">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="309" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="309">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_14461" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081400" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_262" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="79" name="259" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="310">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="311" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081408" size="8" />
			<output>
				<port id="0" precision="I64" names="311">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="312" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="312">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="313" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="313">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="339" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="339">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="340" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3178604" size="32" />
			<output>
				<port id="0" precision="I64" names="340">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="341" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="341">
					<dim>8</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_777" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3178636" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="342" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="342">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="343" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3178668" size="24" />
			<output>
				<port id="0" precision="I64" names="343">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="345" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="345">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="347" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="347">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_795" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3178692" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="348" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="348">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="221" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 512, 1" offset="3178716" size="2097152" />
			<output>
				<port id="0" precision="FP32" names="221">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="349/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_817" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1024, 1" offset="5275868" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="349" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="349">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="350" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="350">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="223" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1024, 1" offset="5279964" size="2097152" />
			<output>
				<port id="0" precision="FP32" names="223">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="351/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Reshape_866" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1" offset="7377116" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="351" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="351">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_894" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3178692" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="353" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="353">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="355" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="355">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Convert_922" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="32768" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="369" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="369">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="372" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32792" size="8" />
			<output>
				<port id="0" precision="I64" names="372">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="373" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="373">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="366" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="357,360,363,366">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_14470" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_919" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="112" name="367" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="374">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="375" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="375">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="376" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="376">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="225" type="Const" version="opset1">
			<data element_type="f32" shape="8, 512, 64" offset="7379164" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="225">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="395" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="395">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="398" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="398">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_14479" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081400" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_907" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="120" name="358" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="399">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="400" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081408" size="8" />
			<output>
				<port id="0" precision="I64" names="400">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="401" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="401">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="402" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="402">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Convert_987" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="32768" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="378" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="378">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="381" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32792" size="8" />
			<output>
				<port id="0" precision="I64" names="381">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="382" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="382">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_14488" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="3670" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="383">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="384" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="384">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="385" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="385">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="226" type="Const" version="opset1">
			<data element_type="f32" shape="8, 512, 64" offset="8427740" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="226">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="403" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="403">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="406" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32800" size="8" />
			<output>
				<port id="0" precision="I64" names="406">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Constant_14497" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081400" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Constant_911" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="137" name="361" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="407">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="408" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1081408" size="8" />
			<output>
				<port id="0" precision="I64" names="408">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="409" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="409">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="410" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="410">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Constant_17338" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="2129992" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="Multiply_17246" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="422" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="422">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="424" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="424,427">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="423" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" names="423" />
			</output>
		</layer>
		<layer id="146" name="Constant_1279" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="147" name="425" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="425" />
			</output>
		</layer>
		<layer id="148" name="426" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1081400" size="8" />
			<output>
				<port id="0" precision="I64" names="426" />
			</output>
		</layer>
		<layer id="149" name="Constant_1283" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32816" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="150" name="428" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="428" />
			</output>
		</layer>
		<layer id="151" name="429" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="429" />
			</output>
		</layer>
		<layer id="152" name="Constant_1287" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32816" size="8" />
			<output>
