<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="8" name="image" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32"/>
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="137813824711" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="137913834525" type="Const" version="opset1">
			<data offset="4" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="138013844531" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="138113854735" type="Const" version="opset1">
			<data offset="4" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="9179214528" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="9189224837" type="Const" version="opset1">
			<data offset="12" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="9199234810" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="9209244771" type="Const" version="opset1">
			<data offset="12" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="Constant_2261654438" type="Const" version="opset1">
			<data offset="16" size="6" shape="1,3,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_2261652441/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Subtract_227" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Multiply_3586/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Multiply_3586/fq_weights_1/scale29714360" type="Const" version="opset1">
			<data offset="22" size="256" shape="64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_37391682442/restored_convert/quantized29634657" type="Const" version="opset1">
			<data offset="278" size="9408" shape="64,3,7,7" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Multiply_37391682442/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Multiply_3586/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_3586" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="3,3" pads_end="3,3"/>
			<rt_info>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_35911714468" type="Const" version="opset1">
			<data offset="9686" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_35911712443/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="124" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="124">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="125" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="125">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="126/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="126" type="MaxPool" version="opset8">
			<data strides="2,2" kernel="3,3" pads_begin="1,1" pads_end="1,1" rounding_type="floor" auto_pad="explicit" dilations="1,1" axis="0" index_element_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="126">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_2163164519" type="Const" version="opset1">
			<data offset="9814" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_2143144498" type="Const" version="opset1">
			<data offset="9822" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="140814124399" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="140914134858" type="Const" version="opset1">
			<data offset="9830" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="141014144402" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="141114154639" type="Const" version="opset1">
			<data offset="9830" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="8678714747" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="8688724546" type="Const" version="opset1">
			<data offset="9834" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="8698734831" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="8708744684" type="Const" version="opset1">
			<data offset="9834" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="8278314885" type="Const" version="opset1">
			<data offset="9838" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="8288324570" type="Const" version="opset1">
			<data offset="9842" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="8298334852" type="Const" version="opset1">
			<data offset="9838" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="8308344777" type="Const" version="opset1">
			<data offset="9842" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="9379414384" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="9389424537" type="Const" version="opset1">
			<data offset="9846" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="9399434597" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="9409444426" type="Const" version="opset1">
			<data offset="9846" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="8378414417" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="8388424477" type="Const" version="opset1">
			<data offset="9850" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="8398434516" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="8408444867" type="Const" version="opset1">
			<data offset="9850" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="47" name="5675714651" type="Const" version="opset1">
			<data offset="9854" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="5685724714" type="Const" version="opset1">
			<data offset="9858" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="5695734642" type="Const" version="opset1">
			<data offset="9854" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="5705744909" type="Const" version="opset1">
			<data offset="9858" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="103710414717" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="103810424786" type="Const" version="opset1">
			<data offset="9862" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="103910434861" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="104010444834" type="Const" version="opset1">
			<data offset="9862" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="8778814654" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="8788824888" type="Const" version="opset1">
			<data offset="9866" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="8798834789" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="8808844558" type="Const" version="opset1">
			<data offset="9866" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="6276314807" type="Const" version="opset1">
			<data offset="9870" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="6286324633" type="Const" version="opset1">
			<data offset="9874" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="6296334381" type="Const" version="opset1">
			<data offset="9870" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="6306344621" type="Const" version="opset1">
			<data offset="9874" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="5475514372" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="5485524624" type="Const" version="opset1">
			<data offset="9878" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="5495534681" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="5505544843" type="Const" version="opset1">
			<data offset="9878" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="6376414450" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="6386424582" type="Const" version="opset1">
			<data offset="9882" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="6396434690" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="6406444429" type="Const" version="opset1">
			<data offset="9882" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="7077114729" type="Const" version="opset1">
			<data offset="9886" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="7087124753" type="Const" version="opset1">
			<data offset="9890" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="7097134801" type="Const" version="opset1">
			<data offset="9886" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="74" name="7107144522" type="Const" version="opset1">
			<data offset="9890" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="75" name="7677714894" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="7687724411" type="Const" version="opset1">
			<data offset="9894" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="7697734588" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="7707744549" type="Const" version="opset1">
			<data offset="9894" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="6476514576" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="6486524420" type="Const" version="opset1">
			<data offset="9898" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="6496534816" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="6506544897" type="Const" version="opset1">
			<data offset="9898" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="6876914765" type="Const" version="opset1">
			<data offset="9902" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="6886924513" type="Const" version="opset1">
			<data offset="9906" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="6896934432" type="Const" version="opset1">
			<data offset="9902" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="6906944759" type="Const" version="opset1">
			<data offset="9906" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="6676714507" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="6686724405" type="Const" version="opset1">
			<data offset="9910" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="6696734903" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="6706744366" type="Const" version="opset1">
			<data offset="9910" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="6977014798" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="6987024408" type="Const" version="opset1">
			<data offset="9914" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="6997034720" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="7007044606" type="Const" version="opset1">
			<data offset="9914" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="9579614603" type="Const" version="opset1">
			<data offset="9918" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="9589624357" type="Const" version="opset1">
			<data offset="9922" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="9599634594" type="Const" version="opset1">
			<data offset="9918" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="9609644675" type="Const" version="opset1">
			<data offset="9922" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="105710614486" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="105810624378" type="Const" version="opset1">
			<data offset="9926" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="105910634699" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="106010644855" type="Const" version="opset1">
			<data offset="9926" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="8078114495" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="8088124579" type="Const" version="opset1">
			<data offset="9930" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="8098134630" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="8108144456" type="Const" version="opset1">
			<data offset="9930" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="5875914600" type="Const" version="opset1">
			<data offset="9934" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="5885924849" type="Const" version="opset1">
			<data offset="9938" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="5895934813" type="Const" version="opset1">
			<data offset="9934" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="110" name="5905944804" type="Const" version="opset1">
			<data offset="9938" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="111" name="5275314825" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="112" name="5285324534" type="Const" version="opset1">
			<data offset="9942" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="113" name="5295334363" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="114" name="5305344543" type="Const" version="opset1">
			<data offset="9942" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="5976014879" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="5986024462" type="Const" version="opset1">
			<data offset="9946" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="5996034912" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="6006044369" type="Const" version="opset1">
			<data offset="9946" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="9779814828" type="Const" version="opset1">
			<data offset="9950" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="9789824669" type="Const" version="opset1">
			<data offset="9954" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="9799834876" type="Const" version="opset1">
			<data offset="9950" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="9809844702" type="Const" version="opset1">
			<data offset="9954" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="101710214870" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="101810224471" type="Const" version="opset1">
			<data offset="9958" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="125" name="101910234414" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="102010244666" type="Const" version="opset1">
			<data offset="9958" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="Multiply_3593/fq_weights_1/scale32714375" type="Const" version="opset1">
			<data offset="9962" size="256" shape="64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Multiply_37481762444/restored_convert/quantized32634396" type="Const" version="opset1">
			<data offset="10218" size="36864" shape="64,64,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Multiply_37481762444/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Multiply_3593/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Multiply_3593" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Constant_35981794678" type="Const" version="opset1">
			<data offset="47082" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Constant_35981792445/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="128" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="128">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="129" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="129">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Multiply_3600/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Multiply_3600/fq_weights_1/scale31214447" type="Const" version="opset1">
			<data offset="47210" size="256" shape="64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Multiply_37571832446/restored_convert/quantized31134906" type="Const" version="opset1">
			<data offset="47466" size="36864" shape="64,64,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Multiply_37571832446/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Multiply_3600/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Multiply_3600" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="Constant_36051864393" type="Const" version="opset1">
			<data offset="84330" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="Constant_36051862447/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="131" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="132/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="132" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="132">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="133" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="133">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="139/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="Multiply_3607/fq_weights_1/scale27914636" type="Const" version="opset1">
			<data offset="84458" size="256" shape="64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="Multiply_37661912448/restored_convert/quantized27834591" type="Const" version="opset1">
			<data offset="84714" size="36864" shape="64,64,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="Multiply_37661912448/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="Multiply_3607/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="Multiply_3607" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="Constant_36121944618" type="Const" version="opset1">
			<data offset="121578" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="Constant_36121942449/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="135" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="135">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="136" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="136">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="Multiply_3614/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="Multiply_3614/fq_weights_1/scale29414444" type="Const" version="opset1">
			<data offset="121706" size="256" shape="64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="Multiply_37751982450/restored_convert/quantized29334465" type="Const" version="opset1">
			<data offset="121962" size="36864" shape="64,64,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="Multiply_37751982450/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="162" name="Multiply_3614/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="163" name="Multiply_3614" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="164" name="Constant_36192014795" type="Const" version="opset1">
			<data offset="158826" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="165" name="Constant_36192012451/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="166" name="138" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="138">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="167" name="139/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="168" name="139" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="139">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="169" name="140" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="140">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="170" name="Multiply_3621/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="171" name="Multiply_3621/fq_weights_1/scale33314687" type="Const" version="opset1">
			<data offset="158954" size="512" shape="128,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="172" name="Multiply_37842062452/restored_convert/quantized33234696" type="Const" version="opset1">
			<data offset="159466" size="73728" shape="128,64,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="173" name="Multiply_37842062452/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="174" name="Multiply_3621/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
